[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:17:85
 
         private BankAccount() {}
 
-        public BankAccount(string customerName, double balance, double limitAccount){
-            m_customerName = customerName;
-            m_balance = balance;
-            m_limitAccount = limitAccount;
-        }
+        public BankAccount(string customerName, double balance, double limitAccount){}
 
 

[NoCoverage] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:25:17
 
 
         public string CustomerName{
-            get { return m_customerName; }
+            get {}
         }
 

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:29:17
         }
 
         public double Balance{
-            get { return m_balance; }
+            get {}
         }
 

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:33:9
         }
 
         public void DepositAmount(double amount) 
-        {
-            if (amount < 0)
-            {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);
-            }
-            else {
-                m_balance -= amount;
-            }
-        }
+        {}
 
         public void Debit(double amount)

[NoCoverage] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:35:13
         public void DepositAmount(double amount) 
         {
             if (amount < 0)
-            {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);
-            }
+            {}
             else {
                 m_balance -= amount;

[NoCoverage] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:36:17
         {
             if (amount < 0)
             {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);
+                ;
             }
             else {

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:38:18
             {
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);
             }
-            else {
-                m_balance -= amount;
-            }
+            else {}
         }
 

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
TestesDeMutacao/Bank/application/BankAccount.cs:39:17
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);
             }
             else {
-                m_balance -= amount;
+                                m_balance +=amount;
             }
         }

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:44:9
         }
 
         public void Debit(double amount)
-        {
-            if (amount > m_balance){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
-            }
-
-            if (amount < 0){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
-            }
-
-            m_balance -= amount;
-        }
+        {}
 
         public void Credit(double amount)

[Killed] Equality mutation
TestesDeMutacao/Bank/application/BankAccount.cs:45:17
 
         public void Debit(double amount)
         {
-            if (amount > m_balance){
+            if (amount < m_balance){
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
             }

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:45:36
 
         public void Debit(double amount)
         {
-            if (amount > m_balance){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
-            }
+            if (amount > m_balance){}
 
             if (amount < 0){

[Killed] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:46:17
         public void Debit(double amount)
         {
             if (amount > m_balance){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
+                ;
             }
 

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:49:28
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
             }
 
-            if (amount < 0){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
-            }
+            if (amount < 0){}
 
             m_balance -= amount;

[Killed] Equality mutation
TestesDeMutacao/Bank/application/BankAccount.cs:49:17
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
             }
 
-            if (amount < 0){
+            if (amount > 0){
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
             }

[Killed] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:50:17
             }
 
             if (amount < 0){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
+                ;
             }
 

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
TestesDeMutacao/Bank/application/BankAccount.cs:53:13
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
             }
 
-            m_balance -= amount;
+            
+            m_balance +=amount;
         }
 

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:57:9
         }
 
         public void Credit(double amount)
-        {
-            if (amount < 0)
-            {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
-            }
-
-            if (amount > m_limitAccount) {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountExceedsLimitsAccount);
-            }
-        }
+        {}
 
         public static void Main()

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:59:13
         public void Credit(double amount)
         {
             if (amount < 0)
-            {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
-            }
+            {}
 
             if (amount > m_limitAccount) {

[Killed] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:60:17
         {
             if (amount < 0)
             {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
+                ;
             }
 

[Killed] Equality mutation
TestesDeMutacao/Bank/application/BankAccount.cs:63:17
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
             }
 
-            if (amount > m_limitAccount) {
+            if (amount < m_limitAccount) {
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountExceedsLimitsAccount);
             }

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:63:42
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
             }
 
-            if (amount > m_limitAccount) {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountExceedsLimitsAccount);
-            }
+            if (amount > m_limitAccount) {}
         }
 

[Killed] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:64:17
             }
 
             if (amount > m_limitAccount) {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountExceedsLimitsAccount);
+                ;
             }
         }

[NoCoverage] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:69:9
         }
 
         public static void Main()
-        {
-            BankAccount bank = new("Mr. Bryan Walton", 11.99, 1000);
-
-            bank.Credit(5.77);
-            bank.Debit(11.22);
-            Console.WriteLine("Current balance is ${0}", bank.Balance);
-        }
+        {}
     }
 }

[NoCoverage] String mutation
TestesDeMutacao/Bank/application/BankAccount.cs:70:36
 
         public static void Main()
         {
-            BankAccount bank = new("Mr. Bryan Walton", 11.99, 1000);
+            BankAccount bank = new("", 11.99, 1000);
 
             bank.Credit(5.77);

[NoCoverage] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:72:13
         {
             BankAccount bank = new("Mr. Bryan Walton", 11.99, 1000);
 
-            bank.Credit(5.77);
+            ;
             bank.Debit(11.22);
             Console.WriteLine("Current balance is ${0}", bank.Balance);

[NoCoverage] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:73:13
             BankAccount bank = new("Mr. Bryan Walton", 11.99, 1000);
 
             bank.Credit(5.77);
-            bank.Debit(11.22);
+            ;
             Console.WriteLine("Current balance is ${0}", bank.Balance);
         }

[NoCoverage] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:74:13
 
             bank.Credit(5.77);
             bank.Debit(11.22);
-            Console.WriteLine("Current balance is ${0}", bank.Balance);
+            ;
         }
     }

[NoCoverage] String mutation
TestesDeMutacao/Bank/application/BankAccount.cs:74:31
 
             bank.Credit(5.77);
             bank.Debit(11.22);
-            Console.WriteLine("Current balance is ${0}", bank.Balance);
+            Console.WriteLine("", bank.Balance);
         }
     }
