[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:33:9
         }
 
         public void DepositAmount(double amount) 
-        {
-            var zeroValue = 0;
-
-            if (Math.Max(zeroValue, amount) == zeroValue)
-            {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);
-            }
-            else {
-                m_balance -= amount;
-            }
-        }
+        {}
 
         public void Debit(double amount)

[Killed] Equality mutation
TestesDeMutacao/Bank/application/BankAccount.cs:36:17
         {
             var zeroValue = 0;
 
-            if (Math.Max(zeroValue, amount) == zeroValue)
+            if (Math.Max(zeroValue, amount) != zeroValue)
             {
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);

[Killed] Linq method mutation (Max() to Min())
TestesDeMutacao/Bank/application/BankAccount.cs:36:17
         {
             var zeroValue = 0;
 
-            if (Math.Max(zeroValue, amount) == zeroValue)
+            if (Math.Min(zeroValue, amount)  == zeroValue)
             {
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);

[NoCoverage] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:37:13
             var zeroValue = 0;
 
             if (Math.Max(zeroValue, amount) == zeroValue)
-            {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DepositAmountLessThanZero);
-            }
+            {}
             else {
                 m_balance -= amount;

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:46:9
         }
 
         public void Debit(double amount)
-        {
-            var maxValue = m_balance;
-            var zeroValue = 0;
-
-            if (Math.Max(maxValue, amount) == amount){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
-            }
-
-            if (Math.Max(zeroValue, amount) == zeroValue){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
-            }
-
-            m_balance -= amount;
-        }
+        {}
 
         public void Credit(double amount)

[Killed] Equality mutation
TestesDeMutacao/Bank/application/BankAccount.cs:50:17
             var maxValue = m_balance;
             var zeroValue = 0;
 
-            if (Math.Max(maxValue, amount) == amount){
+            if (Math.Max(maxValue, amount) != amount){
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
             }

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:50:54
             var maxValue = m_balance;
             var zeroValue = 0;
 
-            if (Math.Max(maxValue, amount) == amount){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
-            }
+            if (Math.Max(maxValue, amount) == amount){}
 
             if (Math.Max(zeroValue, amount) == zeroValue){

[Killed] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:51:17
             var zeroValue = 0;
 
             if (Math.Max(maxValue, amount) == amount){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
+                ;
             }
 

[Killed] Equality mutation
TestesDeMutacao/Bank/application/BankAccount.cs:54:17
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
             }
 
-            if (Math.Max(zeroValue, amount) == zeroValue){
+            if (Math.Max(zeroValue, amount) != zeroValue){
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
             }

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:54:58
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
             }
 
-            if (Math.Max(zeroValue, amount) == zeroValue){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
-            }
+            if (Math.Max(zeroValue, amount) == zeroValue){}
 
             m_balance -= amount;

[Killed] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:55:17
             }
 
             if (Math.Max(zeroValue, amount) == zeroValue){
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
+                ;
             }
 

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:62:9
         }
 
         public void Credit(double amount)
-        {
-            var zeroValue = 0;
-            var maxLimitValue = m_limitAccount;
-
-            if (Math.Max(zeroValue, amount) == zeroValue)
-            {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
-            }
-
-            if (Math.Max(maxLimitValue, amount) == amount) {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountExceedsLimitsAccount);
-            }
-        }
+        {}
 
         public static void Main()

[Killed] Block removal mutation
TestesDeMutacao/Bank/application/BankAccount.cs:67:13
             var maxLimitValue = m_limitAccount;
 
             if (Math.Max(zeroValue, amount) == zeroValue)
-            {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
-            }
+            {}
 
             if (Math.Max(maxLimitValue, amount) == amount) {

[Killed] Linq method mutation (Max() to Min())
TestesDeMutacao/Bank/application/BankAccount.cs:71:17
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
             }
 
-            if (Math.Max(maxLimitValue, amount) == amount) {
+            if (Math.Min(maxLimitValue, amount)  == amount) {
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountExceedsLimitsAccount);
             }

[Killed] Equality mutation
TestesDeMutacao/Bank/application/BankAccount.cs:71:17
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
             }
 
-            if (Math.Max(maxLimitValue, amount) == amount) {
+            if (Math.Max(maxLimitValue, amount) != amount) {
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountExceedsLimitsAccount);
             }

[Killed] Statement mutation
TestesDeMutacao/Bank/application/BankAccount.cs:72:17
             }
 
             if (Math.Max(maxLimitValue, amount) == amount) {
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountExceedsLimitsAccount);
+                ;
             }
         }
